open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_sdio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 SDIO host controller — NuttX sdio_dev_s lower-half over the
 * official Beken bk_sdio_host_* SDK API.
 *
 * Role ownership: AP only.  The 24 bk_sdio_host_* symbols are compiled into
 * the AP libdriver.a exclusively; the CP bundle ships the headers but
 * defines none of the symbols, so this file is guarded by CONFIG_BK7258_AP_CORE.
 *
 * Data path:
 *
 *   NuttX MMCSD/SDIO upper half (sdio_dev_s ops):
 *     sendcmd(cmd,arg)  -> bk_sdio_host_send_command + SDK queue completion
 *     recv_r1..r7()     -> bk_sdio_host_get_cmd_rsp_argument
 *     widebus(enable)   -> re-init with 1/4 line
 *     clock(rate)       -> bk_sdio_host_set_clock_freq
 *     recvsetup(buf,len)-> cache the NuttX transfer contract
 *     data sendcmd()     -> bk_sdio_host_config_data(RD) + command +
 *                           bk_sdio_host_wait_receive_data + FIFO drain
 *     sendsetup(buf,len)-> bk_sdio_host_config_data(WR) + write_fifo
 *
 * Notes on SDK behaviour that shaped this driver (verified against the
 * v3.1.1.9 headers, not assumed):
 *
 *  1. bk_sdio_host_driver_init() is a global one-time resource init;
 *     bk_sdio_host_init(config) powers up the unit.  The selected v3.1.1.9
 *     bundle has CONFIG_GPIO_DEFAULT_SET_SUPPORT, so that call assumes the
 *     SDK application's default GPIO table rather than selecting a route.
 *     NuttX must therefore restore the generated board route after every
 *     host init, before the first command.  We call driver_init once and
 *     host_init once at bk7258_sdio_initialize(), then re-init only on
 *     reset()/widebus().
 *  2. The Beken SDIO host API is blocking.  NuttX, however, calls
 *     recvsetup() before it sends the read command and may insert CMD55 before
 *     an application data command.  recvsetup() therefore records only the
 *     transfer contract; sendcmd() arms the SDK data path immediately before
 *     the matching command, then drains the FIFO after command completion.
 *     Write setup occurs after the command and can finish synchronously in
 *     sendsetup().  eventwait() then replays only the resulting
 *     completion/error bits.
 *  3. Command response type maps from the NuttX 32-bit cmd field: no-response
 *     -> SDIO_HOST_CMD_RSP_NONE; R2 (128-bit) -> SDIO_HOST_CMD_RSP_LONG;
 *     R1/R3/R4/R5/R6/R7 (48-bit) -> SDIO_HOST_CMD_RSP_SHORT.  CRC is checked
 *     for R1/R2/R6/R7 (the response types the spec CRC-protects); R3/R4/R5
 *     have no CRC and are sent without crc_check.
 *  4. The SDK ISR remains the sole owner of command and data status.  Its
 *     public queue wait has a four-millisecond slice, so the lower half waits
 *     repeatedly for the same in-flight command up to the NuttX deadline; it
 *     never acknowledges controller status itself.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/signal.h>

#ifdef CONFIG_BK7258_SDIO

#include <errno.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <syslog.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/sdio.h>
#include <nuttx/spinlock.h>
#include <nuttx/wqueue.h>

#include "bk7258_sdk_abi.h"

#include <arch/chip/bk7258_pinmux.h>
#include <arch/chip/bk7258_sdio.h>

/* SDK API headers (Beken).  bk_err_t / BK_OK come via common/bk_err.h. */

#include <driver/sdio_host.h>
#include <driver/sdio_host_types.h>
#include <driver/gpio.h>
#ifdef CONFIG_SDIO_V2P0
#  include <soc/reg_base.h>
#endif
#ifdef CONFIG_SDIO_GDMA_EN
#  include <driver/dma.h>
#endif

#if defined(CONFIG_BK7258_SDIO_4BIT) && \
    !defined(CONFIG_SDCARD_BUSWIDTH_4LINE)
#  error "Selected AP SDK bundle cannot preserve four-bit SDIO data setup"
#elif !defined(CONFIG_BK7258_SDIO_4BIT) && \
      defined(CONFIG_SDCARD_BUSWIDTH_4LINE)
#  error "Four-bit-only AP SDK bundle cannot serve a one-bit SDIO profile"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_SDIO_V2P0
#  define BK7258_SDIO_ID_CMD_TIMEOUT   2500u
#  define BK7258_SDIO_ID_DATA_TIMEOUT  10000u
#  define BK7258_SDIO_XFR_CMD_TIMEOUT  20000u
#  define BK7258_SDIO_XFR_DATA_TIMEOUT 640000u
#else
#  define BK7258_SDIO_ID_CMD_TIMEOUT   5000u
#  define BK7258_SDIO_ID_DATA_TIMEOUT  20000u
#  define BK7258_SDIO_XFR_CMD_TIMEOUT  1200000u
#  define BK7258_SDIO_XFR_DATA_TIMEOUT 12000000u
#endif

/* Response type bits in the NuttX 32-bit command field (see nuttx/sdio.h). */

#define SDIO_NUTTX_RSP_SHIFT           6

#define BK7258_SDIO_CMD_WAIT_MS        100u
#define SDIO_NUTTX_RSP_MASK            (15 << SDIO_NUTTX_RSP_SHIFT)
#define BK7258_SDIO_MAP_COUNT           2u
#define BK7258_SDIO_PIN_COUNT           6u
#define BK7258_SDIO_SDK_DEFAULT_COUNT   3u

#ifdef CONFIG_DEBUG_FS_INFO
#  define BKSDIO_TRACE(fmt, ...) \
     syslog(LOG_INFO, "BKSDIO TRACE " fmt "\n", ##__VA_ARGS__)
#else
#  define BKSDIO_TRACE(fmt, ...) do { } while (0)
#endif

extern bk_err_t gpio_sdio_sel(int mode);
extern bk_err_t gpio_sdio_one_line_sel(int mode);

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_sdio_priv_s
{
  struct sdio_dev_s dev;          /* NuttX lower-half vtable anchor */
  FAR const struct bk7258_sdio_board_s *board;
  bool widebus_enabled;           /* 4-bit mode active */
  bool initialized;                /* bk_sdio_host_init() done */
  bool driver_init;                /* bk_sdio_host_driver_init() done */
  bool interface_init;             /* dev vtable copied exactly once */
  uint32_t width_transitions;       /* Successful 1-bit/4-bit re-inits */
  uint32_t width_failures;          /* Failed width re-inits */
  int last_width_error;             /* Most recent width re-init status */
  uint32_t cmd_timeout;            /* Controller clock-cycle timeout */
  uint32_t data_timeout;           /* Controller clock-cycle timeout */
#ifdef CONFIG_SDIO_GDMA_EN
  dma_id_t dma_tx_channel;
#endif


  /* Cached data-transfer setup (used by recv/send setup). */

  FAR uint8_t *xfer_buf;
  size_t xfer_nbytes;
  size_t blocklen;
  size_t nblocks;
  bool xfer_is_read;
  bool xfer_pending;
  bool single_write;              /* Outstanding NuttX CMD24 request */
  bool single_read;               /* Outstanding NuttX CMD17 request */
  uint32_t command_r1;            /* Original response before internal CMD12 */

  /* Cached completion status for the polling event shim. */

  sdio_eventset_t events;
  sdio_eventset_t waitset;
  int xfer_result;

  /* Mechanical card-detect polling and MMC/SD media-change callback.  The
   * storage is always present; the selected binding decides at runtime
   * whether the fixed-media path or this polling path is active.
   */

  spinlock_t media_lock;
  struct work_s media_work;
  worker_t callback;
  FAR void *callback_arg;
  sdio_eventset_t callback_events;
  bool reported_present;
  bool media_poll_started;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void bk7258_sdio_reset(FAR struct sdio_dev_s *dev);
static sdio_capset_t bk7258_sdio_capabilities(FAR struct sdio_dev_s *dev);
static sdio_statset_t bk7258_sdio_status(FAR struct sdio_dev_s *dev);
static void bk7258_sdio_widebus(FAR struct sdio_dev_s *dev, bool enable);
static void bk7258_sdio_clock(FAR struct sdio_dev_s *dev,
                              enum sdio_clock_e rate);
static int bk7258_sdio_attach(FAR struct sdio_dev_s *dev);
static int bk7258_sdio_sendcmd(FAR struct sdio_dev_s *dev, uint32_t cmd,
                               uint32_t arg);
#ifdef CONFIG_SDIO_BLOCKSETUP
static void bk7258_sdio_blocksetup(FAR struct sdio_dev_s *dev,
                                   unsigned int blocklen,
                                   unsigned int nblocks);
#endif
static int bk7258_sdio_recvsetup(FAR struct sdio_dev_s *dev,
                                 FAR uint8_t *buffer, size_t nbytes);
static int bk7258_sdio_sendsetup(FAR struct sdio_dev_s *dev,
                                 FAR const uint8_t *buffer, size_t nbytes);
static int bk7258_sdio_cancel(FAR struct sdio_dev_s *dev);
static int bk7258_sdio_waitresponse(FAR struct sdio_dev_s *dev,
                                    uint32_t cmd);
static int bk7258_sdio_recv_r1(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R1);
static int bk7258_sdio_recv_r2(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t R2[4]);
static int bk7258_sdio_recv_r3(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R3);
static int bk7258_sdio_recv_r4(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R4);
static int bk7258_sdio_recv_r5(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R5);
static int bk7258_sdio_recv_r6(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R6);
static int bk7258_sdio_recv_r7(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R7);
static void bk7258_sdio_waitenable(FAR struct sdio_dev_s *dev,
                                   sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t bk7258_sdio_eventwait(FAR struct sdio_dev_s *dev);
static void bk7258_sdio_callbackenable(FAR struct sdio_dev_s *dev,
                                       sdio_eventset_t eventset);
static int bk7258_sdio_registercallback(FAR struct sdio_dev_s *dev,
                                        worker_t callback, FAR void *arg);
static void bk7258_sdio_media_worker(FAR void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_sdio_priv_s g_bk7258_sdio;

