open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
static const struct sdio_dev_s g_bk7258_sdio_ops =
{
  .reset        = bk7258_sdio_reset,
  .capabilities = bk7258_sdio_capabilities,
  .status       = bk7258_sdio_status,
  .widebus      = bk7258_sdio_widebus,
  .clock        = bk7258_sdio_clock,
  .attach       = bk7258_sdio_attach,
  .sendcmd      = bk7258_sdio_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
  .blocksetup   = bk7258_sdio_blocksetup,
#endif
  .recvsetup    = bk7258_sdio_recvsetup,
  .sendsetup    = bk7258_sdio_sendsetup,
  .cancel       = bk7258_sdio_cancel,
  .waitresponse = bk7258_sdio_waitresponse,
  .recv_r1      = bk7258_sdio_recv_r1,
  .recv_r2      = bk7258_sdio_recv_r2,
  .recv_r3      = bk7258_sdio_recv_r3,
  .recv_r4      = bk7258_sdio_recv_r4,
  .recv_r5      = bk7258_sdio_recv_r5,
  .recv_r6      = bk7258_sdio_recv_r6,
  .recv_r7      = bk7258_sdio_recv_r7,
  .waitenable   = bk7258_sdio_waitenable,
  .eventwait    = bk7258_sdio_eventwait,
  .callbackenable = bk7258_sdio_callbackenable,
  .registercallback = bk7258_sdio_registercallback,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_sdio_map_err
 ****************************************************************************/

static int bk7258_sdio_map_err(bk_err_t err)
{
  if (err == BK_OK)
    {
      return OK;
    }

  switch (err)
    {
      case BK_ERR_SDIO_HOST_CMD_RSP_TIMEOUT:
      case BK_ERR_SDIO_HOST_DATA_TIMEOUT:
        return -ETIMEDOUT;
      case BK_ERR_SDIO_HOST_NOT_INIT:
        return -EAGAIN;
      default:
        return -EIO;
    }
}

/* v3.1.1.9 waits only four milliseconds in each public command-queue call.
 * Keep the same command in flight and repeat that public wait until the
 * NuttX command deadline expires.  The SDK ISR remains the sole owner of
 * command status and queue delivery throughout the transaction.
 */



static bk_err_t bk7258_sdio_wait_command(uint32_t cmd_index)
{
  clock_t start;
  clock_t limit;
  bk_err_t err;

  start = clock_systime_ticks();
  limit = MSEC2TICK(BK7258_SDIO_CMD_WAIT_MS);
  if (limit < 1)
    {
      limit = 1;
    }

  do
    {
      err = bk_sdio_host_wait_cmd_response(cmd_index);
      if (err != BK_ERR_SDIO_HOST_CMD_RSP_TIMEOUT)
        {
          return err;
        }
    }
  while (clock_systime_ticks() - start < limit);

  return BK_ERR_SDIO_HOST_CMD_RSP_TIMEOUT;
}

static bk_err_t bk7258_sdio_retry_status(
  FAR const sdio_host_cmd_cfg_t *command, bk_err_t err)
{
  unsigned int retries = 0;

  /* The SDK's sd_card_driver.c:bk_sdcard_wait_busy_to_idle retries a
   * command for up to one second while the card finishes programming.
   * A consumed hardware response-timeout cannot recover by merely waiting
   * on the now-empty SDK queue. Reissue only the read-only SEND_STATUS;
   * never replay a data command or suppress CRC/other errors. Each command
   * wait is bounded to 100 ms, with at most eight additional attempts.
   */

  while (command->cmd_index == 13u &&
         err == BK_ERR_SDIO_HOST_CMD_RSP_TIMEOUT && retries < 8u)
    {
      retries++;
      nxsig_usleep(1000);
      err = bk_sdio_host_send_command(command);
      if (err != BK_OK)
        {
          break;
        }

      err = bk7258_sdio_wait_command(command->cmd_index);
    }

  if (retries != 0)
    {
      syslog(LOG_WARNING, "BKSDIO STATUS retry=%u sdk=%d\n", retries, err);
    }

  return err;
}


static int bk7258_sdio_configure_pins(
  FAR const struct bk7258_sdio_pin_config_s *pins)
{
  static const uint8_t expected[BK7258_SDIO_MAP_COUNT]
                               [BK7258_SDIO_PIN_COUNT] =
  {
    {2u, 3u, 4u, 5u, 10u, 11u},
    {14u, 15u, 16u, 17u, 18u, 19u},
  };
  static const uint8_t sdk_defaults[BK7258_SDIO_SDK_DEFAULT_COUNT] =
  {
    2u, 3u, 4u
  };
  struct bk7258_pinmux_config_s reclaim[
    BK7258_SDIO_SDK_DEFAULT_COUNT + BK7258_SDIO_PIN_COUNT];
  const uint8_t *selected;
  gpio_id_t gpio;
  size_t count;
  size_t index;
  size_t selected_count;
  bk_err_t error;
  int ret;

  if (pins == NULL || pins->map_mode >= BK7258_SDIO_MAP_COUNT)
    {
      return -EINVAL;
    }

  selected = expected[pins->map_mode];
  if (pins->clk_pin != selected[0] || pins->cmd_pin != selected[1] ||
      memcmp(pins->data_pin, &selected[2], sizeof(pins->data_pin)) != 0)
    {
      return -EINVAL;
    }

  if (bk_gpio_driver_init() != BK_OK)
    {
      return -EIO;
    }

#ifdef CONFIG_BK7258_SDIO_4BIT
  /* Physical pin ownership and the negotiated protocol width are different
   * facts.  A four-line instance must own and pull up DAT1-DAT3 from power-on
   * even though the controller starts in one-line identification mode.  The
   * SDK default tables can leave optional SDIO data pins in unrelated output
   * functions; leaving DAT3 there can hold the card-select signal low during
   * CMD0 and put an attached device into SPI mode.  ACMD6 still remains the
   * only point that changes the controller's bus width.
   */

  selected_count = BK7258_SDIO_PIN_COUNT;
#else
  selected_count = 3u;
#endif
  count = 0u;
  for (index = 0u; index < BK7258_SDIO_SDK_DEFAULT_COUNT; index++)
    {
      reclaim[count].pin = sdk_defaults[index];
      reclaim[count].function = 0u;
      reclaim[count].peripheral = false;
      count++;
    }

  /* A one-bit binding owns only CLK/CMD/D0 and leaves every unselected data
   * pin available to its selected platform function.
   */

  for (index = 0u; index < selected_count; index++)
    {
      reclaim[count].pin = selected[index];
      reclaim[count].function = 0u;
      reclaim[count].peripheral = false;
      count++;
    }

  ret = bk7258_pinmux_apply(reclaim, count);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_BK7258_SDIO_4BIT
  error = gpio_sdio_sel(pins->map_mode);
#else
  error = gpio_sdio_one_line_sel(pins->map_mode);
#endif
  if (error != BK_OK)
    {
      return -EIO;
    }

  for (index = 0u; index < selected_count; index++)
    {
      gpio = (gpio_id_t)selected[index];
      if (bk_gpio_pull_up(gpio) != BK_OK ||
          bk_gpio_set_capacity(gpio, GPIO_DRIVER_CAPACITY_3) != BK_OK)
        {
          return -EIO;
        }
    }

  return OK;
}

static bool bk7258_sdio_card_detect_enabled(
  FAR const struct bk7258_sdio_priv_s *priv)
{
  return priv != NULL && priv->board != NULL &&
         priv->board->card_detect_available;
}

#ifdef CONFIG_SDIO_V2P0
static void bk7258_sdio_finish_stop_transmission(void)
{
  /* Match the tail of the official v3.1.1.9 CMD12 sequence on every exit.
   * The command needs a continuously clocked card; its tail returns the
   * controller to the SDK's FIFO-controlled state.  The next command restores
   * continuous clocking.  Reset once more afterward because the controller
   * may have prefetched invalid data before the card accepted CMD12.
   */

