open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
  bk_sdio_tx_fifo_clk_gate_config(0);
  bk_sdio_clk_gate_config(0);
  bk_sdio_host_reset_sd_state();
}


#endif

static int bk7258_sdio_finish_single_transfer(
  FAR struct bk7258_sdio_priv_s *priv, int result)
{
#ifdef CONFIG_SDIO_V2P0
  sdio_host_cmd_cfg_t command = {0};
  bk_err_t err;
  uint32_t r1 = 0;
  bool stop = (priv->single_write || priv->single_read) && result != OK;

#ifdef CONFIG_SDIO_GDMA_EN
  /* Only TX uses DMA. Its CMD24 translation needs a bounded STOP even on
   * success. RX uses the CPU FIFO in both profiles and keeps native CMD17;
   * abort an incomplete native single-block request only on error.
   */

  stop = stop || priv->single_write;
#endif
  priv->single_write = false;
  priv->single_read = false;
  if (stop)
    {
      command.cmd_index = 12u;
      command.response = SDIO_HOST_CMD_RSP_SHORT;
      command.wait_rsp_timeout = priv->cmd_timeout;
      command.crc_check = true;

      bk_sdio_host_reset_sd_state();
      bk_sdio_clk_gate_config(1);
      err = bk_sdio_host_send_command(&command);
      if (err == BK_OK)
        {
          err = bk7258_sdio_wait_command(12u);
        }

      if (err == BK_OK)
        {
          r1 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
        }

      bk7258_sdio_finish_stop_transmission();
      if (result == OK)
        {
          result = err != BK_OK ? bk7258_sdio_map_err(err) :
                   (r1 & 0xfdffe088u) != 0 ? -EIO : OK;
        }
    }

#endif

  priv->xfer_result = result;
  priv->xfer_pending = false;
  priv->events = result == OK ? SDIOWAIT_TRANSFERDONE : SDIOWAIT_ERROR;
  return result;
}

#ifdef CONFIG_SDIO_V2P0
static void bk7258_sdio_select_single_block(void)
{
  /* The SDK's V2 config_data API always selects multiblock mode, matching
   * its card driver's CMD18/CMD25-only policy. NuttX also issues CMD17/24.
   * Match the BK7258 LL single-block helpers by changing SD_DATA_MUL_BLK
   * only: sdio_reg.h word 0x07, bit 3, RW. No IRQ status is acknowledged.
   * The caller runs before CMD17 or before the first CPU TX FIFO word.
   */

  FAR volatile uint32_t *control = (FAR volatile uint32_t *)
    ((uintptr_t)SOC_SDIO_REG_BASE + 0x07u * 4u);

  *control &= ~(1u << 3);
}
#endif

/****************************************************************************
 * Name: bk7258_sdio_complete_read
 *
 * Description:
 *   Finish the read configured by recvsetup().  The SDK's convenience
 *   bk_sdio_host_read_blks_fifo() hard-codes 512-byte blocks, while NuttX
 *   also requests short protocol records such as the 8-byte SCR.  Drain the
 *   public word FIFO directly so the configured block geometry is honoured.
 *   Follow the official SDK CPU-FIFO order for every block: wait for the data
 *   completion token first, validate its CRC/error result, then drain the
 *   FIFO.  The selected profile constrains NuttX to single-block transfers,
 *   so this preserves the SDK contract without a multiblock overflow window.
 ****************************************************************************/

static int bk7258_sdio_complete_read(
  FAR struct bk7258_sdio_priv_s *priv, uint32_t cmd_index)
{
  size_t offset = 0;
  size_t block;
  size_t chunk;
  size_t copied;
  uint32_t word;
  bk_err_t err;

  if (!priv->xfer_pending || !priv->xfer_is_read ||
      priv->xfer_buf == NULL || priv->blocklen == 0 ||
      priv->nblocks == 0)
    {
      return -EINVAL;
    }

  for (block = 0; block < priv->nblocks && offset < priv->xfer_nbytes;
       block++)
    {
      chunk = priv->blocklen;
      if (chunk > priv->xfer_nbytes - offset)
        {
          chunk = priv->xfer_nbytes - offset;
        }

      err = bk_sdio_host_wait_receive_data();
      if (err != BK_OK)
        {
          syslog(LOG_ERR,
                 "BKSDIO CMD%lu RX wait failed: block=%lu/%lu "
                 "blocklen=%lu bytes=%lu sdk=%d\n",
                 (unsigned long)cmd_index,
                 (unsigned long)block,
                 (unsigned long)priv->nblocks,
                 (unsigned long)priv->blocklen,
                 (unsigned long)priv->xfer_nbytes, err);
          priv->xfer_pending = false;
          return bk7258_sdio_map_err(err);
        }

      copied = 0;
      while (copied < chunk)
        {
          size_t bytes = chunk - copied;

          err = bk_sdio_host_read_fifo(&word);
          if (err != BK_OK)
            {
              syslog(LOG_ERR,
                     "BKSDIO CMD%lu RX fifo failed: block=%lu/%lu offset=%lu "
                     "sdk=%d\n",
                     (unsigned long)cmd_index,
                     (unsigned long)block,
                     (unsigned long)priv->nblocks,
                     (unsigned long)(offset + copied), err);
              priv->xfer_pending = false;
              return bk7258_sdio_map_err(err);
            }

          if (bytes > sizeof(word))
            {
              bytes = sizeof(word);
            }

          memcpy(priv->xfer_buf + offset + copied, &word, bytes);
          copied += bytes;
        }

      offset += chunk;
    }

  priv->xfer_pending = false;
  return offset == priv->xfer_nbytes ? OK : -EIO;
}

/****************************************************************************
 * Name: bk7258_sdio_host_init_locked
 *
 * Description:
 *   (Re)initialise the Beken SDIO host with the given bus width.  Caller
 *   holds no lock assumption; this is the single place that builds
 *   sdio_host_config_t.
 ****************************************************************************/

static int bk7258_sdio_host_init_locked(FAR struct bk7258_sdio_priv_s *priv,
                                        bool widebus)
{
  sdio_host_config_t cfg;
  bk_err_t err;
  int ret;

  /* Init the host at the slowest supported clock: SD card protocol wants
   * 400 kHz, but the V2.0 enum's slowest divider is 100 kHz.
   */

#ifdef CONFIG_SDIO_V2P0
  cfg.clock_freq = SDIO_HOST_CLK_100K;
#else
  cfg.clock_freq = SDIO_HOST_CLK_400K;
#endif
  cfg.bus_width = widebus ? SDIO_HOST_BUS_WIDTH_4LINE
                          : SDIO_HOST_BUS_WIDTH_1LINE;
#ifdef CONFIG_SDIO_GDMA_EN
  /* The selected SDK owns DMA allocation and the blocking completion. */
  err = bk_dma_driver_init();
  if (err != BK_OK)
    {
      return bk7258_sdio_map_err(err);
    }
  cfg.dma_tx_en = 1;
#else
  cfg.dma_tx_en = 0;
#endif
  cfg.dma_rx_en = 0;

#ifdef CONFIG_SDIO_V2P0
  /* Match the official v3.1.1.9 bk_sd_card_init() ordering.  Continuous
   * clocking is needed while the card is leaving its power-up state; the
   * setting survives bk_sdio_host_init()'s partial register reset.
   */

  bk_sdio_clk_gate_config(1);
#endif

