open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
  /* bk_sdio_host_init() in the fixed v3.1.1.9 SDK raises CLK_PWR_ID_SDIO
   * through sys_drv_dev_clk_pwr_up() -> bk_pm_clock_ctrl().  The AP linker
   * wrapper translates that existing vendor edge to the CP-owned RPMsg PM
   * service.  Do not add a second explicit vote here: it would double the
   * server reference count and leave the clock pinned after deinit.
   */

  err = bk_sdio_host_init(&cfg);
  if (err == BK_OK)
    {
#ifdef CONFIG_SDIO_GDMA_EN
      unsigned int channel;
      for (channel = 0; channel < DMA_ID_MAX; channel++)
        {
          if ((bk_dma_user((dma_id_t)channel) & 0xffffu) == DMA_DEV_SDIO)
            {
              break;
            }
        }
      /* The SDK returns BK_OK even if allocation failed.  Its GDMA ISR
       * build cannot safely fall back to the CPU TX semaphore path. */
      if (channel == DMA_ID_MAX)
        {
          (void)bk_sdio_host_deinit();
          return -ENOMEM;
        }
      priv->dma_tx_channel = (dma_id_t)channel;
      syslog(LOG_INFO, "BKSDIO TX DMA channel=%u RX=cpu-fifo\n", channel);
#endif

      /* v3.1.1.9 sdio_host_init_common() trusts its SDK-application GPIO
       * default table when CONFIG_GPIO_DEFAULT_SET_SUPPORT is enabled.  That
       * table is not a board binding for NuttX, so re-apply the generated
       * physical route after every init.  Keep this inside the single re-init
       * path so reset and the post-ACMD6 width transition preserve it.
       */

      ret = bk7258_sdio_configure_pins(priv->board->pins);
      if (ret < 0)
        {
          (void)bk_sdio_host_deinit();
          return ret;
        }

      /* The official SD-card wrapper gives the powered controller and card
       * 30 ms to settle before issuing CMD0.
       */

      up_mdelay(30);
      priv->widebus_enabled = widebus;
      priv->initialized = true;
      priv->cmd_timeout = BK7258_SDIO_ID_CMD_TIMEOUT;
      priv->data_timeout = BK7258_SDIO_ID_DATA_TIMEOUT;
    }
  return bk7258_sdio_map_err(err);
}

static void bk7258_sdio_reset(FAR struct sdio_dev_s *dev)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  bk_err_t err;
  int ret;

  if (priv->initialized)
    {
      err = bk_sdio_host_deinit();
      if (err != BK_OK)
        {
          priv->width_failures++;
          priv->last_width_error = bk7258_sdio_map_err(err);
          return;
        }

      priv->initialized = false;
    }

  priv->single_write = false;
  priv->single_read = false;
  ret = bk7258_sdio_host_init_locked(priv, priv->widebus_enabled);
  if (ret < 0)
    {
      priv->width_failures++;
      priv->last_width_error = ret;
    }
  else
    {
      priv->last_width_error = OK;
    }
}

static sdio_capset_t bk7258_sdio_capabilities(FAR struct sdio_dev_s *dev)
{
  /* Advertise exactly the data mode compiled into the selected SDK bundle.
   * The v3.1.1.9 V2 data-setup helpers re-apply their private compile-time
   * width on every transfer.  SDIO_CAPS_4BIT_ONLY makes NuttX send ACMD6 and
   * call widebus(true) before its first data transfer (the SCR read), so the
   * card and the fixed-four-line controller become wide at the same point.
   * The ordinary SDIO_CAPS_4BIT path reads SCR first and is therefore unsafe
   * with that bundle.  The default bundle remains explicitly one-bit-only.
   */

  (void)dev;
#ifdef CONFIG_BK7258_SDIO_4BIT
  return SDIO_CAPS_4BIT_ONLY;
#else
  /* NuttX tests this explicit flag before sending ACMD6.  Returning zero
   * does not mean one-bit-only; it means that the upper half may still
   * switch an SD card to four data lines.
   */

  return SDIO_CAPS_1BIT_ONLY;
#endif
}

static sdio_statset_t bk7258_sdio_status(FAR struct sdio_dev_s *dev)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;

  return priv != NULL && priv->board != NULL &&
         priv->board->card_present() ? SDIO_STATUS_PRESENT : 0;
}

static void bk7258_sdio_widebus(FAR struct sdio_dev_s *dev, bool enable)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  bk_err_t err;
  int ret;

#ifndef CONFIG_BK7258_SDIO_4BIT
  enable = false;
#endif

  if (priv->initialized && (enable != priv->widebus_enabled))
    {
      /* Bus width is fixed at host-init; re-init to apply.  This resets the
       * controller but is the only SDK path to change width.
       */

      err = bk_sdio_host_deinit();
      if (err != BK_OK)
        {
          priv->width_failures++;
          priv->last_width_error = bk7258_sdio_map_err(err);
          return;
        }

      priv->initialized = false;
      ret = bk7258_sdio_host_init_locked(priv, enable);
      if (ret < 0)
        {
          priv->width_failures++;
          priv->last_width_error = ret;
          return;
        }

      priv->width_transitions++;
      priv->last_width_error = OK;
    }
}

static void bk7258_sdio_clock(FAR struct sdio_dev_s *dev,
                              enum sdio_clock_e rate)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
#ifdef CONFIG_SDIO_V2P0
  sdio_host_clock_freq_t freq = SDIO_HOST_CLK_100K;
#else
  sdio_host_clock_freq_t freq = SDIO_HOST_CLK_400K;
#endif

  if (!priv->initialized)
    {
      return;
    }

  /* Map the NuttX clock enum onto the nearest Beken divider.  The V2.0
   * enum carries divider indices (100K..20M/80M); the non-V2.0 enum
   * carries real Hz values.
   */

  switch (rate)
    {
      case CLOCK_SDIO_DISABLED:
        return;   /* leave running; SDK has no explicit gate here */
      case CLOCK_IDMODE:
#ifdef CONFIG_SDIO_V2P0
        freq = SDIO_HOST_CLK_100K;
#else
        freq = SDIO_HOST_CLK_400K;
#endif
        break;
      case CLOCK_MMC_TRANSFER:
      case CLOCK_SD_TRANSFER_1BIT:
      case CLOCK_SD_TRANSFER_4BIT:
      default:
#ifdef CONFIG_SDIO_V2P0
        /* Match the official v3.1.1.9 BK7258 SD-card profile.  Its
         * CONFIG_SDCARD_DEFAULT_CLOCK_FREQ is enum value 14, i.e. 20 MHz.
         * Profiles using this immutable CPU-FIFO SDK bundle constrain NuttX
         * to single-block transfers, avoiding the controller's multiblock
         * pre-read overflow without reducing ordinary block throughput.
         */

        freq = SDIO_HOST_CLK_20M;
#else
        freq = SDIO_HOST_CLK_26M;
#endif
        break;
    }

  if (bk_sdio_host_set_clock_freq(freq) == BK_OK)
    {
      /* Keep the continuous card clock selected by host_init_locked().
       * Official v3.1.1.9 and Tuya both leave it enabled across CMD7,
       * CMD16 and the ordinary transfer-clock switch.  Disabling it here
       * makes command clocking depend on FIFO state and can prevent the
       * first post-selection command from reaching the card.  CMD12 owns
       * its separate, bounded gate sequence in sendcmd().
       */

      if (rate == CLOCK_IDMODE)
        {
          priv->cmd_timeout = BK7258_SDIO_ID_CMD_TIMEOUT;
          priv->data_timeout = BK7258_SDIO_ID_DATA_TIMEOUT;
        }
      else if (rate != CLOCK_SDIO_DISABLED)
        {
          priv->cmd_timeout = BK7258_SDIO_XFR_CMD_TIMEOUT;
          priv->data_timeout = BK7258_SDIO_XFR_DATA_TIMEOUT;
        }
    }
}

