open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
static int bk7258_sdio_attach(FAR struct sdio_dev_s *dev)
{
  /* The SDK owns and registers the controller ISR. */

  return OK;
}

static int bk7258_sdio_sendcmd(FAR struct sdio_dev_s *dev, uint32_t cmd,
                               uint32_t arg)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  sdio_host_cmd_cfg_t host_cmd;
  uint32_t rsp_type;
  bk_err_t err;
#ifdef CONFIG_SDIO_V2P0
  bool stop_transmission;
#endif

  if (!priv->initialized)
    {
      return -EAGAIN;
    }

  host_cmd.cmd_index = cmd & 0x3f;
#if defined(CONFIG_SDIO_V2P0) && defined(CONFIG_SDIO_GDMA_EN)
  /* The V2 SDK configures every write data phase as multiblock. Match its
   * wire command and bound a NuttX single-block request with CMD12 after
   * sendsetup() completes. BLOCKSETUP follows CMD24 in the NuttX contract.
   */

  if (host_cmd.cmd_index == 24u)
    {
      host_cmd.cmd_index = 25u;
    }
#endif
  host_cmd.argument  = arg;
  host_cmd.wait_rsp_timeout = priv->cmd_timeout;
  host_cmd.crc_check = true;

  BKSDIO_TRACE("CMD_BEGIN CMD%lu arg=%08lx flags=%08lx pending=%u",
               (unsigned long)host_cmd.cmd_index,
               (unsigned long)arg, (unsigned long)cmd,
               priv->xfer_pending);

  rsp_type = (cmd & SDIO_NUTTX_RSP_MASK) >> SDIO_NUTTX_RSP_SHIFT;
  switch (rsp_type)
    {
      case 0: /* no response */
        host_cmd.response = SDIO_HOST_CMD_RSP_NONE;
        host_cmd.crc_check = false;
        break;
      case 3: /* R2, 128-bit */
        host_cmd.response = SDIO_HOST_CMD_RSP_LONG;
        break;
      case 4: /* R3, no CRC */
      case 5: /* R4, no CRC */
      case 6: /* R5, no CRC */
        host_cmd.response = SDIO_HOST_CMD_RSP_SHORT;
        host_cmd.crc_check = false;
        break;
      default: /* R1/R6/R7 and others, 48-bit with CRC */
        host_cmd.response = SDIO_HOST_CMD_RSP_SHORT;
        break;
    }

#ifdef CONFIG_SDIO_V2P0
  stop_transmission = host_cmd.cmd_index == 12u;

  /* BK7258 continues pre-reading after the requested CMD18 blocks.  With
   * FIFO-controlled clock backpressure, those residual words can stop the
   * card clock before CMD12 is issued.  The official v3.1.1.9 SD-card driver
   * resets the data/FIFO state and temporarily forces the clock on around
   * STOP_TRANSMISSION; preserve that hardware protocol here.
   */

  if (stop_transmission)
    {
      bk_sdio_host_reset_sd_state();
    }
  else if (host_cmd.cmd_index == 24u || host_cmd.cmd_index == 25u)
    {
      /* NuttX sends the write command before sendsetup(), so this command
       * edge is the only correct place to match the SDK's write reset.
       */

      bk_sdio_host_reset_sd_state();
    }

  /* Restore continuous command clocking after the CMD12 gate sequence.
   */

  bk_sdio_clk_gate_config(1);
#endif

#ifdef CONFIG_SDIO_V2P0
  if (host_cmd.cmd_index == 17u && priv->xfer_pending &&
      priv->xfer_is_read && priv->blocklen == 512u && priv->nblocks == 1u)
    {
      bk7258_sdio_select_single_block();
    }
#endif

  err = bk_sdio_host_send_command(&host_cmd);
  if (err != BK_OK)
    {
      syslog(LOG_ERR,
             "BKSDIO command start failed: CMD%lu arg=%08lx sdk=%d\n",
             (unsigned long)host_cmd.cmd_index,
             (unsigned long)host_cmd.argument, err);
#ifdef CONFIG_SDIO_V2P0
      if (stop_transmission)
        {
          bk7258_sdio_finish_stop_transmission();
        }
#endif

      priv->xfer_result = bk7258_sdio_map_err(err);
      priv->events = SDIOWAIT_ERROR;
      if ((cmd & MMCSD_DATAXFR_MASK) != 0)
        {
          priv->xfer_pending = false;
        }

      return priv->xfer_result;
    }

  err = bk7258_sdio_wait_command(host_cmd.cmd_index);
  err = bk7258_sdio_retry_status(&host_cmd, err);
#ifdef CONFIG_SDIO_V2P0
  if (stop_transmission)
    {
      bk7258_sdio_finish_stop_transmission();
    }
#endif

  priv->xfer_result = bk7258_sdio_map_err(err);
  BKSDIO_TRACE("CMD_DONE CMD%lu sdk=%d result=%d",
               (unsigned long)host_cmd.cmd_index, err, priv->xfer_result);
  if (err != BK_OK)
    {
      syslog(LOG_ERR,
             "BKSDIO command failed: CMD%lu arg=%08lx timeout=%lu "
             "sdk=%d\n",
             (unsigned long)host_cmd.cmd_index,
             (unsigned long)host_cmd.argument,
             (unsigned long)host_cmd.wait_rsp_timeout, err);
      priv->events = SDIOWAIT_ERROR;
      if ((cmd & MMCSD_DATAXFR_MASK) != 0)
        {
          priv->xfer_pending = false;
        }

      return priv->xfer_result;
    }

  priv->events |= SDIOWAIT_CMDDONE | SDIOWAIT_RESPONSEDONE;
  priv->command_r1 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
#ifdef CONFIG_SDIO_V2P0
  if ((cmd & MMCSD_CMDIDX_MASK) == 24u &&
      (priv->command_r1 & 0xfdffe088u) == 0)
    {
      priv->single_write = true;
    }
  else if ((cmd & MMCSD_CMDIDX_MASK) == 17u &&
           (priv->command_r1 & 0xfdffe088u) == 0)
    {
      priv->single_read = true;
    }
#endif

  /* recvsetup() must precede the command in the NuttX contract.  Complete
   * only on the actual read-data command; an intervening CMD55 must leave
   * the pending SCR/ACMD transfer armed.
   */

  if (priv->xfer_pending && priv->xfer_is_read &&
      (cmd & MMCSD_DATAXFR_MASK) != 0 &&
      (cmd & MMCSD_WRXFR) == 0)
    {
      priv->xfer_result =
        bk7258_sdio_complete_read(priv, host_cmd.cmd_index);
      if (priv->single_read)
        {
          priv->xfer_result =
            bk7258_sdio_finish_single_transfer(priv, priv->xfer_result);
        }

      if (priv->xfer_result < 0)
        {
          priv->events |= SDIOWAIT_ERROR;
        }
      else
        {
          priv->events |= SDIOWAIT_TRANSFERDONE;
        }
    }


  return priv->xfer_result;
}

#ifdef CONFIG_SDIO_BLOCKSETUP
static void bk7258_sdio_blocksetup(FAR struct sdio_dev_s *dev,
                                   unsigned int blocklen,
                                   unsigned int nblocks)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;

  priv->blocklen = blocklen;
  priv->nblocks = nblocks;
}
#endif

static int bk7258_sdio_recvsetup(FAR struct sdio_dev_s *dev,
                                 FAR uint8_t *buffer, size_t nbytes)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  sdio_host_data_config_t dcfg;
  bk_err_t err;

