open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
  if (!priv->initialized)
    {
      return -EAGAIN;
    }

  if (buffer == NULL || nbytes == 0 || nbytes > UINT32_MAX)
    {
      return -EINVAL;
    }

#ifdef CONFIG_SDIO_BLOCKSETUP
  if (priv->blocklen == 0 || priv->nblocks == 0 ||
      priv->nblocks > SIZE_MAX / priv->blocklen ||
      priv->blocklen * priv->nblocks != nbytes ||
      priv->blocklen > UINT32_MAX)
    {
      return -EINVAL;
    }
#else
  priv->blocklen = nbytes;
  priv->nblocks = 1;
#endif

  priv->xfer_buf = buffer;
  priv->xfer_nbytes = nbytes;
  priv->xfer_is_read = true;
  priv->xfer_pending = true;

  dcfg.data_timeout    = priv->data_timeout;
  dcfg.data_len        = (uint32_t)nbytes;
  dcfg.data_block_size = (uint32_t)priv->blocklen;
  dcfg.data_dir        = SDIO_HOST_DATA_DIR_RD;

  BKSDIO_TRACE("RX_CONFIG len=%lu blocks=%lu bytes=%lu",
               (unsigned long)priv->blocklen,
               (unsigned long)priv->nblocks,
               (unsigned long)nbytes);

#ifdef CONFIG_SDIO_V2P0
  if (priv->blocklen == 512u)
    {
      bk_sdio_host_reset_sd_state();
      bk_sdio_host_discard_previous_receive_data_sema();
    }
#endif

  err = bk_sdio_host_config_data(&dcfg);
  if (err != BK_OK)
    {
      syslog(LOG_ERR,
             "BKSDIO RX config failed: blocklen=%lu blocks=%lu bytes=%lu "
             "sdk=%d\n",
             (unsigned long)priv->blocklen,
             (unsigned long)priv->nblocks,
             (unsigned long)nbytes, err);
      priv->xfer_result = bk7258_sdio_map_err(err);
      priv->events = SDIOWAIT_ERROR;
      priv->xfer_pending = false;
      return priv->xfer_result;
    }

  priv->xfer_result = OK;
  return OK;
}

/* Give DMA an aligned internal-SRAM snapshot. The MMCSD lock serializes
 * requests, and the existing DMA completion/error cleanup keeps this storage
 * owned until the channel stops. The AIDK profile limits requests to 16
 * sectors. Reject larger requests before arming the data path.
 */

#ifdef CONFIG_SDIO_GDMA_EN
static uint32_t g_sdio_tx_sram[8192 / sizeof(uint32_t)];
#endif

static int bk7258_sdio_sendsetup(FAR struct sdio_dev_s *dev,
                                 FAR const uint8_t *buffer, size_t nbytes)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  sdio_host_data_config_t dcfg;
  bk_err_t err;
#if defined(CONFIG_SDIO_V2P0) && !defined(CONFIG_SDIO_GDMA_EN)
  uint32_t write_status;
#endif

  if (!priv->initialized)
    {
      return bk7258_sdio_finish_single_transfer(priv, -EAGAIN);
    }

  if (buffer == NULL || nbytes == 0 || nbytes > UINT32_MAX)
    {
      return bk7258_sdio_finish_single_transfer(priv, -EINVAL);
    }

#ifdef CONFIG_SDIO_BLOCKSETUP
  if (priv->blocklen == 0 || priv->nblocks == 0 ||
      priv->nblocks > SIZE_MAX / priv->blocklen ||
      priv->blocklen * priv->nblocks != nbytes ||
      priv->blocklen > UINT32_MAX)
    {
      return bk7258_sdio_finish_single_transfer(priv, -EINVAL);
    }
#else
  priv->blocklen = nbytes;
  priv->nblocks = 1;
#endif

  /* The v3.1.1.9 CPU FIFO writer loads 32-bit words.  Reject a partial word
   * or unaligned source instead of reading beyond the caller's buffer or
   * relying on Cortex-M unaligned-access policy.  FAT_DIRECT_RETRY can then
   * retry an unaligned direct transfer through its aligned sector buffer.
   */

  if (((uintptr_t)buffer & 3u) != 0)
    {
      return bk7258_sdio_finish_single_transfer(priv, -EFAULT);
    }

  if ((nbytes & 3u) != 0 || (nbytes % 512u) != 0)
    {
      return bk7258_sdio_finish_single_transfer(priv, -ENOTSUP);
    }

  if (priv->single_write && nbytes != 512u)
    {
      return bk7258_sdio_finish_single_transfer(priv, -EINVAL);
    }

#ifdef CONFIG_SDIO_GDMA_EN
  if (nbytes > sizeof(g_sdio_tx_sram))
    {
      return bk7258_sdio_finish_single_transfer(priv, -E2BIG);
    }
#endif

  priv->xfer_buf = (FAR uint8_t *)buffer;
  priv->xfer_nbytes = nbytes;
  priv->xfer_is_read = false;
  priv->xfer_pending = true;

  dcfg.data_timeout    = priv->data_timeout;
  dcfg.data_len        = (uint32_t)nbytes;
  dcfg.data_block_size = (uint32_t)priv->blocklen;
  dcfg.data_dir        = SDIO_HOST_DATA_DIR_WR;

  err = bk_sdio_host_config_data(&dcfg);
  if (err != BK_OK)
    {
      return bk7258_sdio_finish_single_transfer(priv, bk7258_sdio_map_err(err));
    }

#if defined(CONFIG_SDIO_V2P0) && !defined(CONFIG_SDIO_GDMA_EN)
  if (priv->single_write)
    {
      bk7258_sdio_select_single_block();
    }
#endif

  /* bk_sdio_host_write_fifo blocks internally until the FIFO accepts the
   * data; data_size must be 512-byte aligned per the SDK contract.
   */

#ifdef CONFIG_SDIO_GDMA_EN
  /* A previous failed transfer masked its completion before releasing the
   * buffer.  The SDK resets transfer accounting when this write begins. */
  (void)bk_dma_enable_finish_interrupt(priv->dma_tx_channel);
#endif
#ifdef CONFIG_SDIO_GDMA_EN
  memcpy(g_sdio_tx_sram, buffer, nbytes);
  err = bk_sdio_host_write_fifo((const uint8_t *)g_sdio_tx_sram,
                                (uint32_t)nbytes);
#else
  err = bk_sdio_host_write_fifo(buffer, (uint32_t)nbytes);
#endif
#if defined(CONFIG_SDIO_V2P0) && !defined(CONFIG_SDIO_GDMA_EN)
  /* The pinned SDK's CPU ISR posts tx_sema on DATA_WR_END even when the
   * card's write-response token is rejected. Its return value alone does
   * not validate the write. Read the final token BEFORE CMD12/reset.
   * BK7258 sdio_reg.h: CMD_RSP_INT_SEL word 0x0d, WR_STATUS[22:20] is RO;
   * sdio_ll.h defines token 2 as accepted. IRQ W1C bits remain SDK-owned.
   * This checks the final block; it cannot recover an earlier block error
   * hidden by the SDK's multiblock CPU loop.
   */

  write_status = *(FAR volatile const uint32_t *)
    ((uintptr_t)SOC_SDIO_REG_BASE + 0x0du * 4u);
  if (err == BK_OK && ((write_status >> 20) & 7u) != 2u)
    {
      err = BK_FAIL;
    }
#endif
#ifdef CONFIG_SDIO_GDMA_EN
  if (err == BK_OK && bk_dma_get_enable_status(priv->dma_tx_channel) != 0)
    {
      /* Do not release the caller's source while DMA can still read it,
       * even if the SDK's FIFO-completion semaphore has been posted.
       */

      err = BK_FAIL;
    }

  if (err != BK_OK)
    {
      /* The SDK's timeout path leaves DMA armed.  Stop before returning
       * ownership of the source buffer to the MMCSD/FAT caller. */
      irqstate_t flags = enter_critical_section();
      (void)bk_dma_stop(priv->dma_tx_channel);
      (void)bk_dma_disable_finish_interrupt(priv->dma_tx_channel);
      leave_critical_section(flags);
      bk_sdio_host_reset_sd_state();
    }
#endif
  return bk7258_sdio_finish_single_transfer(priv, bk7258_sdio_map_err(err));
}

static int bk7258_sdio_cancel(FAR struct sdio_dev_s *dev)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;

  /* A blocking SDK call cannot be interrupted, but an armed read that has
   * not yet received its command can be cancelled safely.
   */

