open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
  priv->xfer_pending = false;
  priv->xfer_buf = NULL;
  priv->xfer_nbytes = 0;

  return bk7258_sdio_finish_single_transfer(priv, OK);
}

static int bk7258_sdio_waitresponse(FAR struct sdio_dev_s *dev,
                                    uint32_t cmd)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;

  /* sendcmd() already completed this command through the SDK command queue.
   * Do not consume the SDK queue twice; simply replay the cached result.
   */

  (void)cmd;
  return priv->xfer_result;
}

static int bk7258_sdio_recv_r1(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R1)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R1 != NULL)
    {
      *R1 = ((FAR struct bk7258_sdio_priv_s *)dev)->command_r1;
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r2(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t R2[4])
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R2 != NULL)
    {
      /* 128-bit response spans the four Beken response registers.  The SDK
       * lays the CID/CSD out MSB-first across RSP0..RSP3; we copy them in
       * that order into the NuttX R2[4] (MSB in R2[0]).
       */

      R2[0] = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
      R2[1] = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP1);
      R2[2] = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP2);
      R2[3] = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP3);

    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r3(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R3)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R3 != NULL)
    {
      *R3 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r4(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R4)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R4 != NULL)
    {
      *R4 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r5(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R5)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R5 != NULL)
    {
      *R5 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r6(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R6)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R6 != NULL)
    {
      *R6 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static int bk7258_sdio_recv_r7(FAR struct sdio_dev_s *dev, uint32_t cmd,
                                FAR uint32_t *R7)
{
  bk7258_sdio_waitresponse(dev, cmd);
  if (R7 != NULL)
    {
      *R7 = bk_sdio_host_get_cmd_rsp_argument(SDIO_HOST_RSP0);
    }

  return ((FAR struct bk7258_sdio_priv_s *)dev)->xfer_result;
}

static void bk7258_sdio_waitenable(FAR struct sdio_dev_s *dev,
                                   sdio_eventset_t eventset, uint32_t timeout)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;

  (void)timeout;

  /* This arms a new wait.  Requested bits are not completion bits; keep
   * them separate and discard stale completion from the preceding command.
   * The SDK applies its own bounded command/data waits, so timeout is only
   * represented by the mapped SDIOWAIT_TIMEOUT result below.
   */

  priv->waitset = eventset;
  priv->events = 0;
}

static sdio_eventset_t bk7258_sdio_eventwait(FAR struct sdio_dev_s *dev)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  sdio_eventset_t ev;

  /* Replay the cached completion status.  For a successful transfer this is
   * SDIOWAIT_CMDDONE | SDIOWAIT_TRANSFERDONE; on error SDIOWAIT_ERROR.
   */

  ev = priv->events & priv->waitset;

  if ((priv->events & SDIOWAIT_ERROR) != 0)
    {
      ev |= priv->xfer_result == -ETIMEDOUT ? SDIOWAIT_TIMEOUT
                                            : SDIOWAIT_ERROR;
    }

  if (ev == 0)
    {
      ev = SDIOWAIT_ERROR;
    }

  priv->events = 0;
  priv->waitset = 0;
  return ev;
}

static void bk7258_sdio_callbackenable(FAR struct sdio_dev_s *dev,
                                       sdio_eventset_t eventset)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  irqstate_t flags;

  if (!bk7258_sdio_card_detect_enabled(priv))
    {
      /* Fixed-media slots never report insertion/ejection callbacks. */

      return;
    }

  /* The MMC/SD upper half arms one expected edge at a time.  Keep the
   * reported level unchanged while callbacks are disabled so an edge that
   * occurs between probe/remove and this call is delivered by the next poll.
   */

  flags = spin_lock_irqsave(&priv->media_lock);
  priv->callback_events = eventset &
                          (SDIOMEDIA_INSERTED | SDIOMEDIA_EJECTED);
  spin_unlock_irqrestore(&priv->media_lock, flags);
}

static void bk7258_sdio_media_worker(FAR void *arg)
{
  FAR struct bk7258_sdio_priv_s *priv = arg;
  worker_t callback = NULL;
  FAR void *callback_arg = NULL;
  sdio_eventset_t edge;
  irqstate_t flags;
  bool present;
  bool restart;
  int ret;

  present = priv->board->card_present();
  edge = present ? SDIOMEDIA_INSERTED : SDIOMEDIA_EJECTED;

  flags = spin_lock_irqsave(&priv->media_lock);
  if (present != priv->reported_present &&
      (priv->callback_events & edge) != 0)
    {
      priv->reported_present = present;
      priv->callback_events = 0;
      callback = priv->callback;
      callback_arg = priv->callback_arg;
    }

  restart = priv->media_poll_started;
  spin_unlock_irqrestore(&priv->media_lock, flags);

  /* NuttX requires media callbacks from work-thread context.  Invoke the
   * upper half without holding the private spinlock because it immediately
   * samples status and rearms the opposite edge.
   */

  if (callback != NULL)
    {
      callback(callback_arg);
    }

  if (restart)
    {
      ret = work_queue(HPWORK, &priv->media_work,
                       bk7258_sdio_media_worker, priv,
                       MSEC2TICK(priv->board->media_poll_ms));
      if (ret < 0)
        {
          flags = spin_lock_irqsave(&priv->media_lock);
          priv->media_poll_started = false;
          spin_unlock_irqrestore(&priv->media_lock, flags);
          mcerr("ERROR: SDIO card-detect poll stopped: %d\n", ret);
        }
    }
}

