open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_sdio.c
static int bk7258_sdio_registercallback(FAR struct sdio_dev_s *dev,
                                        worker_t callback, FAR void *arg)
{
  FAR struct bk7258_sdio_priv_s *priv =
    (FAR struct bk7258_sdio_priv_s *)dev;
  irqstate_t flags;
  bool start;
  int ret;

  if (!bk7258_sdio_card_detect_enabled(priv))
    {
      /* Registration is still required by the sdio_dev_s ABI, but a
       * fixed-media slot has no edge source to poll. */

      return OK;
    }

  flags = spin_lock_irqsave(&priv->media_lock);
  priv->callback_events = 0;
  priv->callback = callback;
  priv->callback_arg = arg;
  start = !priv->media_poll_started;
  priv->media_poll_started = true;
  spin_unlock_irqrestore(&priv->media_lock, flags);

  if (!start)
    {
      return OK;
    }

  ret = work_queue(HPWORK, &priv->media_work,
                   bk7258_sdio_media_worker, priv, 0);
  if (ret < 0)
    {
      flags = spin_lock_irqsave(&priv->media_lock);
      priv->media_poll_started = false;
      spin_unlock_irqrestore(&priv->media_lock, flags);
    }

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_sdio_initialize(
  FAR struct sdio_dev_s **sdio_dev,
  FAR const struct bk7258_sdio_board_s *board)
{
  FAR struct bk7258_sdio_priv_s *priv = &g_bk7258_sdio;
  clock_t started;
  bk_err_t err;

  if (sdio_dev == NULL || board == NULL || board->pins == NULL ||
      board->card_present == NULL ||
      (board->card_detect_available && board->media_poll_ms == 0))
    {
      return -EINVAL;
    }

  started = clock_systime_ticks();

  if (priv->board == NULL)
    {
      priv->board = board;
    }
  else if (priv->board != board)
    {
      return -EBUSY;
    }

  if (!priv->interface_init)
    {
      priv->dev = g_bk7258_sdio_ops;
      spin_lock_init(&priv->media_lock);
      priv->interface_init = true;
    }

  if (priv->initialized)
    {
      *sdio_dev = &priv->dev;
      return OK;
    }

  priv->events = 0;
  priv->waitset = 0;
  priv->xfer_result = OK;
  priv->xfer_buf = NULL;
  priv->xfer_nbytes = 0;
  priv->blocklen = 0;
  priv->nblocks = 0;
  priv->xfer_is_read = false;
  priv->xfer_pending = false;
  if (priv->board->prepare != NULL)
    {
      syslog(LOG_INFO, "BKSDIO INIT stage=prepare-enter wide=%u\n",
             BK7258_SDIO_BUS_WIDTH_4BIT != 0 ? 4u : 1u);
      err = priv->board->prepare(BK7258_SDIO_BUS_WIDTH_4BIT != 0);
      if (err < 0)
        {
          syslog(LOG_ERR,
                 "BKSDIO INIT stage=prepare-fail ret=%d elapsed=%lu ms\n",
                 err,
                 (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
          return err;
        }

      syslog(LOG_INFO, "BKSDIO INIT stage=prepare-pass elapsed=%lu ms\n",
             (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
    }

  if (bk7258_sdio_card_detect_enabled(priv))
    {
      priv->reported_present = priv->board->card_present();
    }

  if (!priv->driver_init)
    {
      syslog(LOG_INFO, "BKSDIO INIT stage=driver-enter\n");
      err = bk_sdio_host_driver_init();
      if (err != BK_OK)
        {
          syslog(LOG_ERR,
                 "BKSDIO INIT stage=driver-fail ret=%d elapsed=%lu ms\n",
                 err,
                 (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
          return bk7258_sdio_map_err(err);
        }

      priv->driver_init = true;
      syslog(LOG_INFO, "BKSDIO INIT stage=driver-pass elapsed=%lu ms\n",
             (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
    }


  /* Every SD card powers up in one-bit mode.  The four-bit profile maps
   * D1-D3 at the board layer and advertises SDIO_CAPS_4BIT_ONLY, but the
   * controller must remain narrow until the MMC/SD upper half has sent
   * ACMD6 successfully and calls bk7258_sdio_widebus(true).
   */

  syslog(LOG_INFO, "BKSDIO INIT stage=host-enter width=1\n");
  err = bk7258_sdio_host_init_locked(priv, false);
  if (err != BK_OK)
    {
      if (priv->driver_init)
        {
          bk_sdio_host_driver_deinit();
          priv->driver_init = false;
        }

      syslog(LOG_ERR,
             "BKSDIO INIT stage=host-fail ret=%d elapsed=%lu ms\n",
             err,
             (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
      return err;
    }

  syslog(LOG_INFO, "BKSDIO INIT PASS width=1 elapsed=%lu ms\n",
         (unsigned long)TICK2MSEC(clock_systime_ticks() - started));
  *sdio_dev = &priv->dev;
  return OK;
}

int bk7258_sdio_get_runtime(FAR struct bk7258_sdio_runtime_s *runtime)
{
  FAR struct bk7258_sdio_priv_s *priv = &g_bk7258_sdio;

  if (runtime == NULL)
    {
      return -EINVAL;
    }

  runtime->initialized = priv->initialized ? 1u : 0u;
  runtime->bus_width = priv->widebus_enabled ? 4u : 1u;
  runtime->width_transitions = priv->width_transitions;
  runtime->width_failures = priv->width_failures;
  runtime->last_width_error = priv->last_width_error;
  return OK;
}

#endif /* CONFIG_BK7258_SDIO */
